import React from 'react';

class WhatIs extends React.Component{
  constructor(){
    super();
  }

  render(){
    return (
      <section id="whatis" className="container-fluid">
        <div className="row">
            <div className="col-xs-12 col-sm-10 col-sm-offset-1 col-md-8 col-md-offset-2">
                <h1>WHAT IS BROWN BAG?</h1>
                    <br/>
                <span>                        
                    <blockquote>ครั้งนี้เราขอเดินหน้าขึ้นอีกก้าว เชิญชวน เพื่อนๆ พี่ๆ น้องๆ ญาติสนิทมิตรสหายของเด็กๆ ไอทีบางมด <br/>ไม่ว่าคุณจะอยู่ภาคไหน ไม่ว่าคุณจะรู้จักไอทีหรือไม่ มาร่วมแบ่งขนม ผสมความรู้กันใน <b>Brown Bag #3.0</b> </blockquote> 
                </span>
                <br/>
                <h3><u>วัตถุประสงค์ของงาน</u></h3>
                <span>
                    <ol>
                        <li>เพื่อให้นักศึกษารู้จักการแบ่งปันด้วยการถ่ายทอดความรู้ ประสบการณ์ในด้านที่สนใจให้แก่ผู้อื่น</li>
                        <li>เพื่อเป็นการส่งเสริมให้นักศึกษามีการแลกเปลี่ยนความรู้ ทำความรู้จักกันระหว่างภาควิชา และกลุ่มนักศึกษาที่สนใจในด้านเดียวกัน</li>
                        <li>เพื่อสร้างเสริมทัศคติที่ดีต่อเทคโนโลยีสารสนเทศให้กับนักศึกษาภายในมหาวิทยาลัย และผู้สนใจ</li>
                    </ol>
                </span>
                <br/><br/>
                <h1 className="h1Config">Brown Bag มาจากไหน?</h1>
                <p>
                    <span>
                        <strong>Brown Bag</strong> มาจากปกติแล้วคนอเมริกาชอบใช้เจ้า<em> ถุงน้ำตาล </em>นี่แหละ <u>เป็นพวกใส่อาหารสำเร็จรูป</u> ที่หาได้จาก Supermarket หรือโรงอาหารต่างๆ จะเอามาไว้ใส่อาหารเพื่อมานั่งกิน และพูดคุยสนทนากัน เอาง่ายๆ เหมือนคนไทยเราอะครับ คนต่างจังหวัดเวลาเราทำไร่ทำนาหรือทำสวนก็จะห่อข้าวไปกินแล้วมานั่งคุยกัน ทางเราก็ได้นำชื่อเจ้าถุงกระดาษสีน้ำตาลนี่แหละ มาเป็นชื่อสำหรับการนั่งคุยกัน สนทนากันแบบเป็นกันเอง ไม่เครียด อยากคุยอะไรก็คุย แบบไม่เป็นทางการ
                    </span>
                </p>
                <br/><br/>
                <h1 className="h1Config">รูปแบบงานเป็นอย่างไร?</h1>
                <p>
                    <span>
                       เป็นการพูดคุยและแบ่งปันประสบการณ์อย่างเป็นกันเอง<strong> โดยจะมีการนำเสนอหัวข้อที่สนใจ </strong>จากผู้ที่ต้องการมาแบ่งปันประสบการณ์ภายในงาน ผู้เข้าร่วมงานทุกๆคนจะช่วยกันเลือกเรื่องที่สนใจ เรื่องที่ถูกเลือกนั้นจะได้รับการแบ่งปันภายในงาน <u>ผู้เข้าร่วมงานทุกๆ คนจะต้องเตรียมขนมกันมาคนละ 1 ชิ้น</u> เพื่อนำมาแลกเปลี่ยนกันภายในงานเหมือนดั่งเช่น ความคิดเห็นและประสบการณ์ที่เรานำมาแลกเปลี่ยนกันภายในงาน
                    </span>
                </p>
                <br/><br/>
                <h2>อยากแชร์ประสบการณ์ภายในงานต้องทำอย่างไร?</h2>
                <p>
                    <span>
                        <a href="https://goo.gl/MUpgTJ">กรอกแบบฟอร์มมาได้เลยครับ Click!</a> แต่จะมีข้อกำหนดสำหรับหัวข้อที่จะแชร์ภายในงานสักเล็กน้อยนะครับ 
                    </span>
                </p>
            </div>
        </div>
      </section>
    );
  }
}


export default WhatIs;
